УчетВУправляющихДляГит1/src/InformationRegisters/ДокументыФизическихЛиц/ДокументыФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДокументыФизическихЛиц</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КемВыдан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодПодразделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЯвляетсяДокументомУдостоверяющимЛичность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыДокументовФизическихЛиц</types>
    </type>
  </resources>
  <resources>
    <name>ФамилияЛатиницей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяЛатиницей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПричинаИзменения</name>
    <type>
      <types>CatalogRef.КВП_ПричиныИзмененияПаспортныхДанных</types>
    </type>
  </resources>
  <resources>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef.КВП_ИзменениеПаспортныхДанных</types>
    </type>
  </resources>
  <resources>
    <name>СтранаВыдачи</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </resources>
  <dimensions>
    <name>Физлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыДокументовФизическихЛиц</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/Documents/КВП_ИзменениеПаспортныхДанных/КВП_ИзменениеПаспортныхДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КВП_ИзменениеПаспортныхДанных</name>
  <basedOn>Catalog.УПЖКХ_Жильцы</basedOn>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыДокументовФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачиДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КемВыданДокумент</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПодразделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзменения</name>
    <type>
      <types>CatalogRef.КВП_ПричиныИзмененияПаспортныхДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ДокументВид</name>
    <type>
      <types>CatalogRef.УдалитьДокументыУдостоверяющиеЛичность</types>
    </type>
  </attributes>
</mdclass:Document>

УчетВУправляющихДляГит1/src/InformationRegisters/ДокументыФизическихЛиц/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент)
	
	Если ЯвляетсяУдостоверениемЛичности(Запись.Физлицо, Запись.ВидДокумента, Запись.Период) Тогда
		Запись.ЯвляетсяДокументомУдостоверяющимЛичность = Истина;
	КонецЕсли;
	
	СотрудникиКлиентСервер.ОбновитьГруппуФамилияИмяЛатиницей(ЭтотОбъект, "Запись");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ЯвляетсяУдостоверениемЛичности(Физлицо, ВидДокумента, Дата)
	
	Возврат РегистрыСведений.ДокументыФизическихЛиц.ЯвляетсяУдостоверениемЛичности(Физлицо, ВидДокумента, Дата);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьДоступность(Форма)
	
	СотрудникиКлиентСервер.УстановитьВидимостьГруппыФамилияИмяЛатиницей(Форма, "Запись");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	СотрудникиКлиентСервер.ПроверитьНаписаниеФИДокументаЛатинскими(ЭтотОбъект, "Запись", Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыПодсистемыКвартплаты

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Квартплата +
	Если Не Параметры.ЗначениеКопирования.Пустой() Тогда
		Запись.ДокументРегистратор = ПредопределенноеЗначение("Документ.КВП_ИзменениеПаспортныхДанных.ПустаяСсылка");
		Запись.ПричинаИзменения = "";
	КонецЕсли;
	ТолькоПросмотр = ЗначениеЗаполнено(Запись.ДокументРегистратор);
	// Квартплата -
	
	УстановитьВидимостьДоступность(ЭтотОбъект);
	
КонецПроцедуры

// Квартплата +

&НаКлиенте
// Обработчик события "НачалоВыбора" поля ввода "ДокументКемВыдан".
//
Процедура КемВыданНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ФормаВыбора = ПолучитьФорму("Справочник.КВП_ОВД.ФормаВыбора");
	ФормаВыбора.ВладелецФормы = ЭтаФорма;
	ФормаВыбора.ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ОбработатьВыборОВД", ЭтаФорма);
	ФормаВыбора.Открыть();
	
КонецПроцедуры // КемВыданНачалоВыбора()

&НаКлиенте
// Асинхронный обработчик результата выбора элемента справочника "ОВД".
//
Процедура ОбработатьВыборОВД(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		
		СтруктураРеквизитовОВД = УПЖКХ_ОбщегоНазначенияСервер.ПолучитьСтруктуруРеквизитовОВД(ВыбранноеЗначение);
		
		Запись.КемВыдан         = СтруктураРеквизитовОВД.Наименование;
		Запись.КодПодразделения = СтруктураРеквизитовОВД.КодПодразделения;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработатьВыборОВД()

// Квартплата -

#КонецОбласти
